package utils;

public class ConstantStrings {

    public static final String REGISTER_BUTTON = "ПОЛЕТЕЛИ!";
    public static final String GET_RECEIVER_BUTTON = "Узнать получателя!";
    public static final String SET_NAME_BUTTON = "Ввести ФИО";
    public static final String SET_DEPARTMENT_BUTTON = "Указать отдел";

    public static final String REVEAL_NOTIFY = "ВСЕМ ПРИВЕТ! \uD83C\uDF89 \n" +
            "Итак, Дорогие Санты, время пришло!\n" +
            "Кликните на кнопку «" + GET_RECEIVER_BUTTON +
            "» и вперёд выбирать подарки вашей паре " +
            "\uD83C\uDF84 \uD83C\uDF84 \uD83C\uDF84 \uD83C\uDF84 \uD83C\uDF84 \uD83C\uDF84 \uD83C\uDF84";

    public static final String GIFT_NOTIFY = "Время дарить подарки";

    public static final String GREETINGS_MESSAGE = "Тайный Са́нта — рождественская церемония анонимного обмена подарками группой людей.\n" +
            " ⁃ «Википедия»\n\n" +
            "Правила:\n" +
            "Каждый из участников выбирает подарок для вашей пары в игре (по возможности поинтересуйтесь, чем человек интересуется. " +
            "Давайте подарим не просто штуковину, но и немного теплоты \uD83D\uDE07). " +
            "Подарки заворачиваются так, чтобы их невозможно было распознать. Даритель не должен раскрываться при организации игры. " +
            "Обмен будет производиться накануне Праздника. Найдите способ анонимно передать подарочек. \n" +
            "\n" +
            "Нажмите кнопку «" + REGISTER_BUTTON + "» и получите подтверждение об участии. 24.12.21 закрывается приём заявок - " +
            "в 12:00 будет получено случайное имя участника, которому будет выбираться подарок. " +
            "Обмен будет осуществляться 28.12.21! Подготовьте, пожалуйста, подарок заранее - не обижайте своих друзей.\n" +
            " \uD83D\uDE01";
}
